src/bsl/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/СтавкиНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает числовое значение процента ставки НДС
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - , валюта, по которой необходимо 
//  
// Возвращаемое значение:
//  Соотвествие - соответствие ставкам НДС числовых значений НДС
//
Функция ПроцентСтавкиНДС(СтавкаНДС) Экспорт
	
	СоответствиеЗначенийСтавокУчетаНДС = СоответствиеЗначенийСтавокУчетаНДС();	
	ЗначениеСтавки = СоответствиеЗначенийСтавокУчетаНДС.Получить(СтавкаНДС);
	
	Возврат ?(ЗначениеСтавки = Неопределено, 0, ЗначениеСтавки);
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует соответствие ставок НДС их числовым значениям
//  
// Возвращаемое значение:
//  Соотвествие - соответствие ставкам НДС числовых значений НДС
//
Функция СоответствиеЗначенийСтавокУчетаНДС()
	
	СоответствиеСтавокНДС = Новый Соответствие;
	
	Ставки = Перечисления.СтавкиНДС;
	
	СоответствиеСтавокНДС.Вставить(Ставки.БезНДС, 0);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС0, 0);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС10, 10);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС10_110, 10);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС12, 12);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС18, 18);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС18_118, 18);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС20, 20);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС20_120, 20);
		
	Возврат СоответствиеСтавокНДС;     
	
КонецФункции

#КонецОбласти

#КонецЕсли
